Tekla Open API Reference for Tekla Structures 2025
GADrawing Constructor
 Instantiates a new GA drawing using standard attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public GADrawing()
Public Sub New
See Also
Reference
GADrawing Class
GADrawing Overload
Tekla.Structures.Drawing Namespace